In [1]:
import pandas as pd

In [10]:
df = pd.DataFrame({
    "Name": ["Zhang", "Li", "Wang"],
    "Age": [10, 20, 30],
    "Sex": ["male", "female", "male"],
})

In [11]:
df

    Name  Age     Sex
0  Zhang   10    male
1     Li   20  female
2   Wang   30    male

In [13]:
df["Age"]

0    10
1    20
2    30
Name: Age, dtype: int64

In [15]:
df.describe()

        Age
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

In [16]:
data = pd.read_csv("data/ad.csv")

In [17]:
data.head()

      TV  radio  newspaper  sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

In [20]:
data.dtypes

TV           float64
radio        float64
newspaper    float64
sales        float64
dtype: object

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 1 to 200
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 7.8 KB

In [23]:
TV = data["TV"]

In [25]:
TV.head()

1    230.1
2     44.5
3     17.2
4    151.5
5    180.8
Name: TV, dtype: float64

In [31]:
TV.shape
TV.mean()

147.0425

In [28]:
subdata = data.iloc[1:6, 1:3]

In [32]:
subdata.describe()

           radio  newspaper
count   5.000000   5.000000
mean   37.240000  61.260000
std    15.254114  11.514903
min    10.800000  45.100000
25%    39.300000  58.400000
50%    41.300000  58.500000
75%    45.900000  69.300000
max    48.900000  75.000000